return {
    -- 神兵升级 = { 50, 40, 20, 8, 3, 1 },
    神兵升级 = { 89, 71, 36, 14, 3, 1 },
    -- 神兵精炼升级成功率改这里，主要是4上5 千分之20概率 5上6 千分之1概率
    -- 神兵强化 = { 600, 400, 120, 10, 1 },   ---精炼垫底成功几率
    神兵强化 = { 100, 200, 300, 100, 100 },   ---精炼垫底成功几率
    高级神兵石 = { { 100, 90 }, { 100, 30 }, { 100, 5 }, { 100, 6 }, { 100, 1 }, { 100, 1 } }, --多少分之多少的几率成功
    普通装备炼化重复控制 = {
        {
            { 触发 = false, 几率 = 3000 },
            { 触发 = false, 几率 = 6000 },
            { 触发 = false, 几率 = 12000 },
            { 触发 = false, 几率 = 24000 },
        },
        {
            { 触发 = false, 几率 = 2000 },
            { 触发 = false, 几率 = 4000 },
            { 触发 = false, 几率 = 8000 },
            { 触发 = false, 几率 = 16000 },
        },
        {
            { 触发 = false, 几率 = 1200 },
            { 触发 = false, 几率 = 2400 },
            { 触发 = false, 几率 = 4800 },
            { 触发 = false, 几率 = 9600 },
        },
    },
    装备炼器重复控制 = {
        {
            { 触发 = false, 几率 = 1500 },
            { 触发 = false, 几率 = 3000 },
            { 触发 = false, 几率 = 6000 },
            { 触发 = false, 几率 = 12000 },
        },
        {
            { 触发 = false, 几率 = 1000 },
            { 触发 = false, 几率 = 2000 },
            { 触发 = false, 几率 = 4000 },
            { 触发 = false, 几率 = 8000 },
        },
        {
            { 触发 = false, 几率 = 600 },
            { 触发 = false, 几率 = 1200 },
            { 触发 = false, 几率 = 2400 },
            { 触发 = false, 几率 = 4800 },
        },
    },


    神兵精炼重复控制 = {
        {
            { 触发 = false, 几率 = 3000 },
            { 触发 = false, 几率 = 6000 },
            { 触发 = false, 几率 = 12000 },
            { 触发 = false, 几率 = 24000 },
        },
        {
            { 触发 = false, 几率 = 2000 },
            { 触发 = false, 几率 = 4000 },
            { 触发 = false, 几率 = 8000 },
            { 触发 = false, 几率 = 16000 },
        },
        {
            { 触发 = false, 几率 = 1200 },
            { 触发 = false, 几率 = 2400 },
            { 触发 = false, 几率 = 4800 },
            { 触发 = false, 几率 = 9600 },
        },
    },





    炼妖石合成几率 = {
        100, --1
        100, --2
        100, --3
        100, --4
        100, --5
        100, --6
        100, --7
        100, --8
        100, --9
        100, --10
        100, --11
        100, --12
    },

    宝石合成几率 = {
        100, --1
        100, --2
        100, --3
        100, --4
        100, --5
        100, --6
        100, --7
        100, --8
        100, --9
        100, --10
        0
    },

    高级宝石合成几率 =  {100,100,100,100,100,100,100,100,100,100,0},

}
